Revit 2026 API

# ViewPrintingEventArgsIndex Property

---

The index of the view being printed out of the set of all views being printed.

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Index { get; }
```
```vb
Public ReadOnly Property Index As Integer
	Get
```
```cpp
public:
property int Index {
	int get ();
}
```
```fsharp
member Index : int with get
```

#### Property Value

Int32

The index is zero-based. When a single view is being printed, this value should be 0.

#### Reference

ViewPrintingEventArgs Class

Autodesk.Revit.DB.Events Namespace